<a href="https://colab.research.google.com/github/samucale/DATA-SCIENCE-COM-PROF-WALISSON/blob/main/TRATANDO_DADOS_AUSENTES_NO_DATASET.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
import numpy as np

***TRATANDO DADOS AUSENTES NO DATASET***



1.   isnull
2.   dropna
3.   fillna

In [6]:
dados = np.array ([[1,        2, np.nan],
                   [4, np.nan , np.nan,],
                   [7,     8,         9]])
df = pd.DataFrame(dados,columns='A B C'.split())

In [7]:
df

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

In [8]:
df.isnull()

       A      B      C
0  False  False   True
1  False   True   True
2  False  False  False

In [9]:
df ['A'].isnull()

0    False
1    False
2    False
Name: A, dtype: bool

In [10]:
df ['A'].isnull ().sum()

0

In [11]:
df['B'].isnull().sum()

1

In [12]:
df.dropna ()

     A    B    C
2  7.0  8.0  9.0

In [14]:
df.dropna (axis=1)

     A
0  1.0
1  4.0
2  7.0

In [16]:
df['B'].fillna(0)

0    2.0
1    0.0
2    8.0
Name: B, dtype: float64

In [17]:
df ['B']= df['B'].fillna (0)

In [18]:
df

     A    B    C
0  1.0  2.0  NaN
1  4.0  0.0  NaN
2  7.0  8.0  9.0

In [20]:
df.fillna(method='ffill')

     A    B    C
0  1.0  2.0  NaN
1  4.0  0.0  NaN
2  7.0  8.0  9.0

In [21]:
df.fillna(method='bfill')

     A    B    C
0  1.0  2.0  9.0
1  4.0  0.0  9.0
2  7.0  8.0  9.0

In [27]:
df = pd.read_csv('/content/drive/MyDrive/Colab ciencia de dados /arquivodetreino/test_clean.csv')

In [28]:
df.head

<bound method NDFrame.head of       Age Cabin Embarked  ...              Ticket   Title  Family_Size
0    34.5   NaN        Q  ...              330911      Mr            0
1    47.0   NaN        S  ...              363272     Mrs            1
2    62.0   NaN        Q  ...              240276      Mr            0
3    27.0   NaN        S  ...              315154      Mr            0
4    22.0   NaN        S  ...             3101298     Mrs            2
..    ...   ...      ...  ...                 ...     ...          ...
413  30.0   NaN        S  ...           A.5. 3236      Mr            0
414  39.0  C105        C  ...            PC 17758     Mrs            0
415  38.5   NaN        S  ...  SOTON/O.Q. 3101262      Mr            0
416  30.0   NaN        S  ...              359309      Mr            0
417   4.0   NaN        C  ...                2668  Master            2

[418 rows x 14 columns]>